app/controllers/session_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'failure@aa.com' LIMIT 1
---
	def create
		#1-buscar el usuario
        #@user = User.find_by(email: "rafael_flores31@unitec.edu")

		@user = User.find_by(email: params[:email])